# CutColorNumber Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLayerInfo..::..CutColorNumber Property
ExportLayerInfo Class See Also
---
The cut color number stored in value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int CutColorNumber { get; set; }
```

Visual Basic
---
```text
Public Property CutColorNumber As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int CutColorNumber {
	int get ();
	void set (int value);
}
```

# See Also
ExportLayerInfo Class
Autodesk.Revit.DB Namespace